// Генерируем имя
case Rand(1, 11) of
   1: S := 'Гр';
   2: S := 'Ад';
   3: S := 'Вил';
   4: S := 'Кен';
   5: S := 'Лур';
   6: S := 'Тил';
   7: S := 'Гэл';
   8: S := 'Тор';
   9: S := 'Тас';
  10: S := 'Ат';
  11: S := 'Сэл';
end;
case Rand(1, 10) of
   1: S := S + 'ид';
   2: S := S + 'ар';
   3: S := S + 'ор';
   4: S := S + 'ур';
   5: S := S + 'ов';
   6: S := S + 'ик';
   7: S := S + 'ом';
   8: S := S + 'аб';
   9: S := S + 'из';
  10: S := S + 'ок';
end;
if Rand(1, 2) = 1 then
case Rand(1, 8) of
   1: S := S + 'эн';
   2: S := S + 'е';
   3: S := S + 'и';
   4: S := S + 'о';
   5: S := S + 'д';
   6: S := S + 'ес';
   7: S := S + 'ер';
   8: S := S + 'ес';
end;
if GetBool('GenName.Female') then
case Rand(1, 3) of
   1: S := S + 'оя';
   2: S := S + 'ия';
   3: S := S + 'еа';
end;
// Записываем в лог
Log('Сгенерировано имя: ' + S);
// Возвращаем результат генерации
SetStr('GenName.Name', S);

